In [54]:
import pandas as pd
#1
one = pd.Series({'year':'2014', 'name':'bob', 'point': 1.5})
two = pd.Series({'year':'2015', 'name':'tom', 'point': 1.7})
three = pd.Series({'year':'2015', 'name':'kim', 'point': 3.6})
four = pd.Series({'year':'2018', 'name':'lee', 'point': 1.5})
five = pd.Series({'year':'2020', 'name':'park', 'point': 2.4})

group = pd.DataFrame([one, two, three, four, five], index = ['one', 'two', 'three', 'four', 'five'])
group.loc[['three']]

       year name  point
three  2015  kim    3.6

In [16]:
group[['year', 'name']]

       year  name
one    2014   bob
two    2015   tom
three  2015   kim
four   2018   lee
five   2020  park

In [67]:
group.loc[['one'], :]

     year name  point
one  2014  bob    1.5

In [3]:
#2
Korea = pd.Series({'경기수':'14', '금메달':0, '은메달': 1, '동메달':2})
USA = pd.Series({'경기수':'25', '금메달':5, '은메달': 3, '동메달':8})
China = pd.Series({'경기수':'18', '금메달':1, '은메달': 5, '동메달':3})
Japan = pd.Series({'경기수':'15', '금메달':7, '은메달': 1, '동메달':3})
Canada = pd.Series({'경기수':'32', '금메달':8, '은메달': 2, '동메달':6})

group = pd.DataFrame([Korea, USA, China, Japan, Canada], index = ['Korea', 'USA', 'China', 'Japan', 'Canada'])
group

       경기수  금메달  은메달  동메달
Korea   14    0    1    2
USA     25    5    3    8
China   18    1    5    3
Japan   15    7    1    3
Canada  32    8    2    6

In [4]:
group.sort_values(by='금메달', ascending=True)[-3:]

       경기수  금메달  은메달  동메달
USA     25    5    3    8
Japan   15    7    1    3
Canada  32    8    2    6

In [72]:
#3
import pandas as pd
one = pd.Series({'name':'bob', 'age':20, 'score': 90})
two = pd.Series({'name':'tom', 'age':15, 'score': 80})
three = pd.Series({'name':'kim', 'age':27, 'score': 70})
four = pd.Series({'name':'lee', 'age':11, 'score': 95})
five = pd.Series({'name':'park', 'age':30, 'score': 30})

df1 = pd.DataFrame([one, two, three, four, five], index = ['one', 'two', 'three', 'four', 'five'])
df1.iloc[::2, :1]

       name
one     bob
three   kim
five   park

In [70]:
df1.loc[['two', 'four']]
#loc는 string index로 명시

     name  age  score
two   tom   15     80
four  lee   11     95

In [71]:
df1[['name']]

       name
one     bob
two     tom
three   kim
four    lee
five   park

In [ ]:
#4
tripleDF = pd.read_csv('Ontology_CSV.csv', sep=',', names=['subject', 'predicate', 'object'])
randomTripleDF = tripleDF.sample(frac=1)
randomTripleDF.head()

In [ ]:
#5
subClassOfDF = randomTripleDF[randomTripleDF['predicate']=='subClassOf']
subClassOfDF.head()

In [ ]:
#6
del subClassOfDF['object']
subClassOfDF

In [28]:
#1
import pandas as pd
movies = pd.read_csv("http://bit.ly/imdbratings")
movies.head()

movies_content_rating = movies[['content_rating']].drop_duplicates().reset_index(drop=True)
movies_content_rating

   content_rating
0               R
1           PG-13
2       NOT RATED
3              PG
4         UNRATED
5        APPROVED
6          PASSED
7               G
8               X
9             NaN
10          TV-MA
11             GP
12          NC-17

In [22]:
#2
movies_genre = movies[['genre']].drop_duplicates().reset_index(drop=True)
movies_genre

        genre
0       Crime
1      Action
2       Drama
3     Western
4   Adventure
5   Biography
6      Comedy
7   Animation
8     Mystery
9      Horror
10  Film-Noir
11     Sci-Fi
12    History
13   Thriller
14     Family
15    Fantasy

In [23]:
#3
movies_actors_list = movies[['actors_list']].drop_duplicates().reset_index(drop=True)
movies_actors_list

                                           actors_list
0    [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1      [u'Marlon Brando', u'Al Pacino', u'James Caan']
2    [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3    [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4    [u'John Travolta', u'Uma Thurman', u'Samuel L....
..                                                 ...
964  [u'Dustin Hoffman', u'Jessica Lange', u'Teri G...
965  [u'Michael J. Fox', u'Christopher Lloyd', u'Ma...
966  [u'Russell Crowe', u'Paul Bettany', u'Billy Bo...
967  [u'JoBeth Williams', u"Heather O'Rourke", u'Cr...
968  [u'Charlie Sheen', u'Michael Douglas', u'Tamar...

[969 rows x 1 columns]

In [30]:
#4
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.sort_values(ascending=False, by='beer_servings').iloc[0]

country                         Namibia
beer_servings                       376
spirit_servings                       3
wine_servings                         1
total_litres_of_pure_alcohol        6.8
continent                        Africa
Name: 117, dtype: object

In [34]:
#5
#5
one = pd.Series({'name':'bob', 'age':20, 'score': 90})
two = pd.Series({'name':'tom', 'age':15, 'score': 80})
three = pd.Series({'name':'kim', 'age':20, 'score': 70})
four = pd.Series({'name':'lee', 'age':11, 'score': 95})
five = pd.Series({'name':'park', 'age':30, 'score': 30})
six = pd.Series({'name':'jun', 'age': 30, 'score': 55})

df = pd.DataFrame([one, two, three, four, five, six], index = ['one', 'two', 'three', 'four', 'five', 'six'])
df.drop_duplicates('age', keep='first')

      name  age  score
one    bob   20     90
two    tom   15     80
four   lee   11     95
five  park   30     30

In [35]:
df.drop_duplicates('age', keep='last')

      name  age  score
two    tom   15     80
three  kim   20     70
four   lee   11     95
six    jun   30     55